app/graphql/mutations/create_task.rb

INSERT INTO "tasks" ("header", "description", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["header", "List9TaskSecond"], ["description", "aaa"], ["created_at", "2021-02-19 15:11:27.279555"], ["updated_at", "2021-02-19 15:11:27.279555"], ["list_id", 9]]
---
    def resolve(header:, description:, list_id:)
      Task.create!(header: header, description: description, list_id: list_id)