app/graphql/mutations/delete_list.rb

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 2]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def resolve(id:)
      List.find(id).destroy