app/graphql/mutations/edit_list.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "lists" SET "header" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["header", "Newheader"], ["updated_at", "2021-02-19 15:56:39.818046"], ["id", 9]]
---
    def resolve(id:, header:)
      List.find(id).tap do |list|
        list.update(header: header)