app/graphql/mutations/edit_task.rb

    def resolve(id:, header:, description:)
      Task.find(id).tap do |task|
        task.update(header: header, description: description)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "header" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["header", "headerFor task with id eq 10"], ["description", "sss"], ["updated_at", "2021-02-19 16:03:55.942622"], ["id", 10]]