app/graphql/types/query_type.rb

    def list(id:)
      List.find(id)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def task(id:)
      Task.find(id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]