app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @list = List.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @list = List.find(params[:id])

INSERT INTO "lists" ("header", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["header", "Aaa list"], ["created_at", "2021-02-05 22:16:06.803467"], ["updated_at", "2021-02-05 22:16:06.803467"], ["user_id", 1]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "header" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["header", "list1 (edited)"], ["updated_at", "2020-11-08 15:23:53.798202"], ["id", 1]]
---
  def update
    @list = List.find(params[:id])
    if @list.update(list_params)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 8]]
---
  def destroy
    @list = List.find(params[:id])
    @list.destroy