app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @task = Task.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id])

INSERT INTO "tasks" ("header", "description", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["header", "dddasdsx"], ["description", "dsds"], ["created_at", "2020-11-08 13:58:35.933544"], ["updated_at", "2020-11-08 13:58:35.933544"], ["list_id", 1]]
---
  def create
    @task = Task.new(task_params.merge(list_id: params[:list_id]))
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "sssss"], ["updated_at", "2020-11-12 14:31:50.459575"], ["id", 11]]
---
  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 5]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_list
    @list = List.find(params[:list_id])